const posts = {
  1: {
    name: `لجين آل درع`,
    text: ` أدعو الله أن يظل علم بلادي عاليًا مرفرفًا على الدّوام، فعيدنا اليوم يعكس لنا ماضٍ أصيل ويُظهر لنا مستقبلًا زاهرًا`,
    major: `علوم الحاسب`,
  },
  2: {
    name: `رنيم شلوان`,
    text: `دام عزِّك ياوطن، للفخر، للمجد، للعلياء نرفع بهمة راياتك الخضراء، ومعك طموحنا يُعانق السَّماء.`,
    major: `علوم الحاسب`,
  },
  3: {
    name: `خلود الشهري`,
    text: `وما لعينيك الا الحب يا وطني وما لخديك إلا اللثم والقُبل `,
    major: `نظم معلومات`,
  },
  4: {
    name: `امل الشديدي`,
    text: `٩١ عاماً لشعبٍ وارض وملك ، كل عام وانت تعانق السماء مجداً`,
    major: `نظم معلومات`,
  },
  5: {
    name: `أثير آل فايع`,
    text: `اللهم اجعل أيام المملكة كلها فرح ونصر وسلام💚💚`,
    major: `علوم الحاسب`,
  },
  6: {
    name: `سارة هاني ابو غزالة`,
    text: `اللهم أدم علينا الأمن و الأمان`,
    major: `نظم المعلومات`,
  },
  7: {
    name: `ندى العسيري`,
    text: `وَطَنِي أَنْت وَمَالِي لَا اسْمَيْك وَطَن فِيك الْأُمِّيّ تَهُون وَقَلِيلٌ مِنْك ينسيني الشَّجَن.`,
    major: `نظم معلومات`,
  },
  8: {
    name: `لينا عوض عبدالله الشهري`,
    text: `دمت ياوطني متفرداً بالحب والعطاء متميزاً بالأمن والرخاء شامخاً بالمجد والعزه💚💚`,
    major: `علوم حاسب`,
  },
  9: {
    name: `شَادن العمري `,
    text: `يقول غازي القصيبي: 

    تركتُ في مكّة قلبي.. وطالعني
    ‏قلبي بطيْبةَ.. والأطيابُ تنهمرُ
    
    ‏وفي الرياضِ أرى قلبي.. وألمحهُ
    ‏ملءَ الجنوبِ.. وضمّت قلبي الخبرُ
    
    ‏اللهَ! يـا تُـربةً حـبّــاتُهـــا امـتـزجت 
    ‏بالروحِ.. أنتِ الهوى.. والعشقُ.. والوطرُ ! 🤍🤍`,
    major: `علوم حاسب CS `,
  },
  10: {
    name: `غيداء محمد مبارك ال فهيد`,
    text: `كل عام و قلوبنا تنبض بإلانتماء و الإعتزاز، كل عام و وطني يزداد علوًا و رِفعة ..
    دمتِ بخير و في أمن و أمان يا أطهر ثرى 👑💚`,
    major: `علوم الحاسب`,
  },
  11: {
    name: `اروى محمد علي ال عبدالمتعالي`,
    text: `91 عاماً من الهمة و العطاء و الرخاء..
    كل عام ونحن نفخر بأفعالك الكريمة والطيبة بين الأمم ، كل عام وأنت موشح بثياب العز والإزدهار والأمن والسلام💚💚`,
    major: `نظم المعلومات`,
  },
  12: {
    name: `سمية حسن علي أحمدآل حسن`,
    text: `اللهم احفظ بلادنا بلاد الحرمين الشريفين`,
    major: `علوم حاسب`,
  },
  13: {
    name: `نوف التوام`,
    text: `وطنٌ إمتدَّ مَجّدُهُ لـ ٩١ عاماً، دُمتَ آمناً وشامخاً🤍`,
    major: `نظم معلومات`,
  },
  14: {
    name: `رند`,
    text: `وما رقى متن السما شعبٍ سوانا 
    ‏ولا لمع بين النّجوم إلا وطنّا`,
    major: `طالبه`,
  },
  15: {
    name: `فاطمه راشد`,
    text: `كل عام وحنا بأول الصفوف جيل يوصي جيل سيروا لا وقوف  يا وطن شعبك على قلب رجل 💚💚`,
    major: `نظم معلومات`,
  },
  16: {
    name: `بشاير القحطاني`,
    text: `كل عام وهذا الوطن يوِّرث المجد ويصنع الحب ويضيء العالم بالسلام 
    حفظك الله يا وطني شامخًا وادام عليك نعمه وقادته وروّاده 💚
    `,
    major: `علوم حاسب`,
  },
  17: {
    name: `رزان عسيري `,
    text: `وما الحُب الا اليك ،دُمتَ عزيزًاشامخًا🤍`,
    major: `نظم معلومات `,
  },
  18: {
    name: `نوف`,
    text: `من بحرها للبحر ديرتي كلّي فخر`,
    major: `علوم حاسب`,
  },
  19: {
    name: `أروى`,
    text: `ربي اجعل هذا البلد آمنًا `,
    major: `علوم الحاسب `,
  },
  20: {
    name: `لمياء سعد`,
    text: `كل عام و الشعب السعودي في أمان الله في كنفه و في رعايته🤍💚 `,
    major: `اللغة الانجليزية`,
  },
  21: {
    name: `أسماء محمد الفيفي`,
    text: `دمت ياوطني آمنًا، شامخًا، حرًا، أبيًا 🤍`,
    major: `علوم الحاسب`,
  },
  22: {
    name: `فيصل عسيري`,
    text: `يوم وطني سعيد على ممكلتنا الغالية حكومة وشعبا `,
    major: `نظم المعلومات`,
  },
  23: {
    name: `أمجاد سالم سعيد الشهراني`,
    text: `وطن لا نحميه لا نستحق العيش فيه 🌿💚🤍`,
    major: `نظم معلومات `,
  },
  24: {
    name: `معيض ال حمران`,
    text: `يوم وطن يوم عز ويوم فخر  الله يحفظ الدار ويحفظ قادتنا ..

    فكرة مميزة 👏🏻👏🏻👍🏻`,
    major: `موظف`,
  },
  25: {
    name: `أسامة آل درع`,
    text: `‏91 عامًا من العطاء والنماء  `,
    major: `شريعة`,
  },
  26: {
    name: `ساره`,
    text: `اللهم احفظ وطني، وأدِم عزه واستقراره، واحفظ شعبه وحكَّامه.💚    `,
    major: `اللغة الانجليزية    `,
  },
  27: {
    name: `وجدان محمد `,
    text: `‏كل عام ووطنا وقادتنا في عزة وشموخ و أمان و اطمئنان💚🤍    `,
    major: `نظم المعلومات`,
  },
  28: {
    name: `هيفاء`,
    text: `كل عام ووطننا يُعانق السماء
    ‏دمت في عزٍ وازدهار ونماء 💚💚`,
    major: `اللغة الانجليزية`,
  },
  29: {
    name: `ريوف`,
    text: `روحي وما ملكت يداي فداهُ وطني الحبيب وهل أحب سواهُ    `,
    major: `نظم معلومات    `,
  },
  30: {
    name: `امل مبارك هيف `,
    text: `أدام الله الأمن والأمان ع وطننا 🤍    `,
    major: `نظم معلومات`,
  },
  31: {
    name: `إيـــمــــــــــــان    `,
    text: `دام خيرك يا وطن الخير والعزة دمت يا وطني متمتعاً بالعطاء والحب متميزاً بالرخاء والأمن والمجد وحمل الراية العليا.    `,
    major: `لغة انجليزية     `,
  },
  32: {
    name: `ضي عبدالعزيز محمد `,
    text: `الوطن.. هُوَ الاتِجَاهَاتُ الأَربَعَةُ.. لِكُلِ مَن يَطلُبُ اتِجَاهاً.    `,
    major: `لغه انجليزيه`,
  },
  33: {
    name: ``,
    text: ` 91 عامًا من المجد والازدهار والرخاء والأمن والأمان والسلم والسلام، ادامك الله شامخًا يا وطني🤍`,
    major: ``,
  },
  34: {
    name: ``,
    text: ` `,
    major: ``,
  },
  35: {
    name: ``,
    text: ``,
    major: ``,
  },
  36: {
    name: ``,
    text: ``,
    major: ``,
  },
  37: {
    name: ``,
    text: ``,
    major: ``,
  },
  38: {
    name: ``,
    text: ``,
    major: ``,
  },
  39: {
    name: ``,
    text: ``,
    major: ``,
  },
  40: {
    name: ``,
    text: ``,
    major: ``,
  },
  41: {
    name: ``,
    text: ``,
    major: ``,
  },
  42: {
    name: ``,
    text: ``,
    major: ``,
  },
  43: {
    name: ``,
    text: ``,
    major: ``,
  },
  44: {
    name: ``,
    text: ``,
    major: ``,
  },
  45: {
    name: ``,
    text: ``,
    major: ``,
  },
  46: {
    name: ``,
    text: ``,
    major: ``,
  },
  47: {
    name: ``,
    text: ``,
    major: ``,
  },
  48: {
    name: ``,
    text: ``,
    major: ``,
  },
  49: {
    name: ``,
    text: ``,
    major: ``,
  },
  50: {
    name: ``,
    text: ``,
    major: ``,
  },
  51: {
    name: ``,
    text: ``,
    major: ``,
  },
  52: {
    name: ``,
    text: ``,
    major: ``,
  },
  53: {
    name: ``,
    text: ``,
    major: ``,
  },
  54: {
    name: ``,
    text: ``,
    major: ``,
  },
  55: {
    name: ``,
    text: ``,
    major: ``,
  },
  56: {
    name: ``,
    text: ``,
    major: ``,
  },
  57: {
    name: ``,
    text: ``,
    major: ``,
  },
  58: {
    name: ``,
    text: ``,
    major: ``,
  },
  58: {
    name: ``,
    text: ``,
    major: ``,
  },
  59: {
    name: ``,
    text: ``,
    major: ``,
  },
  60: {
    name: ``,
    text: ``,
    major: ``,
  },
  61: {
    name: ``,
    text: ``,
    major: ``,
  },
  62: {
    name: ``,
    text: ``,
    major: ``,
  },
  62: {
    name: ``,
    text: ``,
    major: ``,
  },
  63: {
    name: ``,
    text: ``,
    major: ``,
  },
  64: {
    name: ``,
    text: ``,
    major: ``,
  },
  65: {
    name: ``,
    text: ``,
    major: ``,
  },
  66: {
    name: ``,
    text: ``,
    major: ``,
  },
  67: {
    name: ``,
    text: ``,
    major: ``,
  },
  68: {
    name: ``,
    text: ``,
    major: ``,
  },
  69: {
    name: ``,
    text: ``,
    major: ``,
  },
  70: {
    name: ``,
    text: ``,
    major: ``,
  },
  71: {
    name: ``,
    text: ``,
    major: ``,
  },
  72: {
    name: ``,
    text: ``,
    major: ``,
  },
  73: {
    name: ``,
    text: ``,
    major: ``,
  },
  74: {
    name: ``,
    text: ``,
    major: ``,
  },
  75: {
    name: ``,
    text: ``,
    major: ``,
  },
  76: {
    name: ``,
    text: ``,
    major: ``,
  },
  77: {
    name: ``,
    text: ``,
    major: ``,
  },
  78: {
    name: ``,
    text: ``,
    major: ``,
  },
  79: {
    name: ``,
    text: ``,
    major: ``,
  },
  80: {
    name: ``,
    text: ``,
    major: ``,
  },
  81: {
    name: ``,
    text: ``,
    major: ``,
  },
  82: {
    name: ``,
    text: ``,
    major: ``,
  },
  83: {
    name: ``,
    text: ``,
    major: ``,
  },
  84: {
    name: ``,
    text: ``,
    major: ``,
  },
  85: {
    name: ``,
    text: ``,
    major: ``,
  },
  86: {
    name: ``,
    text: ``,
    major: ``,
  },
  87: {
    name: ``,
    text: ``,
    major: ``,
  },
  88: {
    name: ``,
    text: ``,
    major: ``,
  },
  89: {
    name: ``,
    text: ``,
    major: ``,
  },
  90: {
    name: ``,
    text: ``,
    major: ``,
  },
  91: {
    name: ``,
    text: ``,
    major: ``,
  },
};

/////////////
let n = document.querySelectorAll(".icons_icon").length;
let Name = document.querySelector(".popup_name");
let Tx = document.querySelector(".popup_text");
let Major = document.querySelector(".popup_major");
let close = document.querySelector(".popup_close");

for (let i = 0; i < n; i++) {
  document
    .querySelectorAll(".icons_icon")
    [i].addEventListener("click", function () {
      Name.innerHTML = "    " + posts[i + 1].name;
      Tx.innerHTML = "    " + posts[i + 1].text;
      Major.innerHTML = "    " + posts[i + 1].major;

      if (i + 1 < 31) close.href = "#icons";
      else if (i + 1 < 61) close.href = "#icons2";
      else close.href = "#icons3";
    });
}

close.addEventListener("click", function () {
  Name.innerHTML = "";
  Tx.innerHTML = "";
  Major.innerHTML = "";
});
/*
for (let i = 1; i <= 30; i++) {
  let img = url(`images/icon-${i+1}.jpeg`);
  document.querySelectorAll(".icons_icon")[i].style.backgroundImage = "img";
}*/
